import React from "react";
import "./classes_component.css"
import downward_dog from '../../assets/images/classes/downward_dog.jpg'
import cat_cow from '../../assets/images/classes/cat_cow.jpg'
import seated_crossed from '../../assets/images/classes/seated_crossed.jpg'
import childs_pose from '../../assets/images/classes/childs_pose.jpg'
export default function ClassesComponent() {
    return (
        <div className="classes_component">
            <div className="classes_component_texts">
                <h2>Անվճար Յոգայի Դաս</h2>
                <p className="first_text">Հոգնա՞ծ եք և սթրեսսված:Բացահայտեք ձեր ներքին հանգստությունն ու ճկունությունը այս հանգստացնող 10 րոպեանոց յոգայի դասի միջոցով, որը հարմարեցված է բացարձակ սկսնակների համար: Թող Ադրիենը՝ ձեր ջերմ և աջակցող մարզիչը, նրբորեն առաջնորդի ձեզ յոգայի մի շարք հիմնական դիրքերի միջով, որոնք կօգնեն Ձեզ բարելավել ձեր ճկունությունը և ուղղել ձեր կեցվածքը: Տեսանյութը ներառում է նաև շնչառական վարժություններ, որոնք կօգնեն ձեզ հանգստանալ և քչացնել սթրեսը:</p>
                <p className="second_text">Պատրա՞ստ եք սկսել ձեր յոգայի ճանապարհորդությունը: Սեղմեք տեսանյութի վրա և բացահայտեք շարժման և շնչառության փոխակերպող ուժը:</p>
            </div>

            <div className="classes_component_youtube">
                <iframe
                    width="90%"
                    height="80%"
                    src="https://www.youtube.com/embed/Zo8O6UXLTa0"
                    title="YouTube video player"
                    allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                    allowFullScreen
                ></iframe>

            </div>

            <div className="classes_component_about_video">
                <div className="classes_component_about_video_info">
                    <p>Ներկայացնում ենք տեսանյութում ներկայացված դիրքերի ցանկը`</p>

                    <div className="classes_component_about_video_info_1">
                        <h2>Seated cross-legged position</h2>
                        <p>Նստած խաչաձև դիրքը, որը յոգայում սովորաբար կոչվում է Սուխասանա, կատարվում է հատակին նստած, մի ոտքը հակառակ ծնկի տակ: Ողնաշարը մնում է ձգված և ուղիղ, ձեռքերը հենվում են ծնկների վրա կամ ծալված են մնում: Այս հիմնական դիրքը նպաստում է ճիշտ կեցվածքին և օգնում է հանգստանալ: Այն զարգացնում է կայունության և դյուրինության զգացում` միաժամանակ թույլ տալով կենտրոնանալ շնչառություն վրա:</p>
                        <img src={seated_crossed}></img>
                    </div>

                    <div className="classes_component_about_video_info_2">
                        <h2>Downward Dog position</h2>
                        <p>Սա յոգայի դիրք է, որտեղ դուք սկսում եք հատակին՝ հենվելով ձեռքերի և ծնկների վրա, այնուհետև բարձրացնում եք ձեր կոնքերը վերև և տանւմ եք հետ՝ ստեղծելով շրջված V տառը: Ձեռքերը բացված են ուսերի լայնությամբ, ոտքերը՝ ազդրերի լայնությամբ, և դուք սեղմում եք ձեր ափերը գորգի վրա՝ հետագայում ձգտելով ուղղել ձեր ձեռքերն ու ոտքերը: Այն հիանալի ձգում է մեջքի, մկանների, սրունքների և ուսերի համար, որը հաճախ օգտագործվում է որպես յոգայի հաջորդականության մաս՝ ճկունության համար:</p>

                        <img src={downward_dog}></img>
                    </div>

                    <div className="classes_component_about_video_info_3">
                        <h2>Cat-cow pose</h2>
                        <p>Կատու-կովի դիրքը դինամիկ յոգայի հաջորդականություն է, որը միավորում է երկու փոխլրացնող շարժումներ՝ խթանելու ողնաշարի ճկունությունն ու շարժունակությունը: Սկսեք սեղանի դիրքից չեզոք ողնաշարով: Շնչեք, երբ ձեր մեջքը թեքված է, որովայնն իջեցրեք հատակին և ձեր հայացքը բարձրացրեք առաստաղին (Կովի դիրք): Արտաշնչեք, կլորացրնեք ձեր ողնաշարը, կզակը սեղմելով դեպի կրծքավանդակը և ձեր որովայնը ձգելով դեպի ողնաշարը (կատվի դիրք): Այս երկու դիրքերի միջև շնչառությամբ հոսելը խթանում է ողնաշարի հոդակապումը, ազատում է լարվածությունը մեջքի և պարանոցի մեջ և խթանում շրջանառությունը ամբողջ մարմնում:
                        </p>
                        <img src={cat_cow}></img>
                    </div>

                    <div className="classes_component_about_video_info_4">
                        <h2>Extended child's pose</h2>
                        <p>Երեխայի դիրքը, որը նաև հայտնի է որպես Բալասանա, մեղմ հանգստի դիրք է, որը նպաստում է թուլացմանը և ներդաշնակությանը: Սկսեք սեղանի դիրքից, այնուհետև ձեր ազդրերը իջեցրեք դեպի կրունկները, մինչ ձեր ձեռքերը առաջ եք մեկնում, ափերը հենվում են գետնին: Հենեք ձեր ճակատը գորգի վրա, թույլ տալով, որ ձեր կրծքավանդակը կպնի հատակին: Այս կեցվածքը ձգում է ողնաշարը, և ազդրերը՝ ազատելով լարվածությունից և հոգնածությունից։ Այն ապահովում է սնուցող տարածք խորը շնչառության և մտավոր հանգստի համար՝ այն դարձնելով իդեալական
                            վերականգնողական պրակտիկա կամ որպես հանգստացնող անցում ավելի ակտիվ դիրքերի միջև:
                        </p>
                        <img src={childs_pose}></img>
                    </div>


                </div>

            </div>


        </div>
    )
}